---

C#Visual BasicVisual C++

Revit 2024 API
---
Form..::..ConstrainProfiles Method
Form Class See Also Send Feedback
---

Constrain form profiles using the specified profile as primary. This is an advanced version of property "AreProfilesConstrained", allowing specify the primary profile.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void ConstrainProfiles(
    	int primaryProfileIndex
    )

Visual Basic
---

    Public Sub ConstrainProfiles ( _
    	primaryProfileIndex As Integer _
    )

Visual C++
---

    public:
    void ConstrainProfiles(
    	int primaryProfileIndex
    )

#### Parameters

primaryProfileIndex
    Type: System..::..Int32Index to specify the profile used as primary profile.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation can only be performed on a swept blend form. |

# See Also

Form Class

Autodesk.Revit.DB Namespace